





//声明书

#define  KDT_DECLARATION  @"特别提示\n\
\n\
《口袋助手用户协议》（以下简称“本协议”）适用于所有使用口袋助手的用户（以下或称“您”）。本协议一经同意并接受，即形成您与口袋助手及其关联公司（以下简称“口袋助手”）间有法律约束力之文件。您确认，您已详细阅读了本协议所有内容，您充分理解并同意接受本协议的全部内容。\n\
我们还需要提醒您的是，如本协议内容发生修改或更新，我们将会在口袋助手提示修改内容并公布。您在使用口袋助手产品提供的各项服务之前，应仔细阅读本协议，如您不同意变更后的协议内容，应立即停用口袋助手及相关服务。\n\
\n\
一、口袋助手使用规则\n\
\n\
口袋助手是上海逐腾信息技术有限公司开发的一款可以自动模拟执行您在手机、平板屏幕操作的一切动作的平台软件，可以录制你的屏幕操作然后播放，也可以运行第三方作者用 Lua 脚本语言编写的脚本（口袋助手不编写任何脚本）。口袋助手是您测试软件 BUG 稳定性、娱乐游戏时的好帮手，但口袋助手本身并不对任何游戏或软件进行修改、加速。n\
· 您知晓并确认，因为iOS 系统机制问题，目前口袋助手iOS 版需要通过 Cydia 源方式安装，但口袋助手并没有以任何方式强制要求您进行相关操作，您有权按照您自己的真实意愿决定是否对您的苹果设备进行越狱，因此而产生的任何问题均与口袋助手无关。\n\
· 您知晓并确认，口袋助手在正确安装后，里面并不自带任何针对第三方app的脚本。您有权编写任何脚本，您也可以通过购买或者其他合法渠道获得脚本，但您不得通过任何渠道获得任何违反中华人民共和国法律法规或侵犯第三方合法权益的脚本。\n\
· 您知晓并确认，您自行获得相关脚本后，如果在使用、运行相关脚本的过程中造成了各种可能的不利影响，比如封号，丢失账号数据，或运行脚本导致违反目标程序的用户协议等,您须自行承担各种不利影响，您无权要求口袋助手承担任何责任。\n\
· 您知晓并确认，您在购买口袋助手授权码时，可以在口袋助手官方淘宝店(http://koudaitool.taobao.com)购买。您必须采用口袋助手指定的方式购买授权，可供购买方式包括但不限于：网上银行、第三方支付（例如支付宝、财付通等）、手机充值卡。您的购买行为表示您已经同意并自愿遵守口袋助手的相关授权规则（授权规则的修改权及最终解释权均归口袋助手，具体内容以口袋助手官方淘宝店公布的授权规则为准）。\n\
· 您知晓并确认，您仅可以通过上述官方渠道购买授权码，不得购买来源不明的授权码。口袋助手有权对通过非正常途径充值的授权码进行冻结。口袋助手保留向通过冒充、盗用他人身份或者帐号等非正常途径购买授权码的单位或个人追究法律责任的一切权力。\n\
· 您知晓并确认，口袋助手授权码一旦购买成功并激活使用，购买即确定完成，您不得要求退还已付金额。\n\
· 您知晓并确认，一台设备需要对应购买一个授权码，多台设备的需要购买多个授权码，如果您的授权码已经被使用过，在第二台设备上绑定会提示授权无效，您需要首先解除绑定原设备的授权码，才能使新设备使用这个授权。\n\
· 您知晓并确认，产品终止运营或者运营权发生转移的，有权提前30日予以公告。\n\
· 您知晓并确认，口袋助手提醒您妥善保管好您的授权码。如由于您自身原因遗失或泄漏授权码，口袋助手不承担任何责任。\n\
\n\
二、知识产权\n\
\n\
· 口袋助手网站（www.koudaitool.com）所有的LOGO、商标、图形、口袋助手软件及其他产品、技术、源代码与所有程序的知识产权及其他合法权益均属于口袋助手，在此并未授权。\n\
· 未经口袋助手许可，任何人不得擅自以任何方式（包括但不限于：以非法的方式复制、传播、展示、镜像、上传、下载）使用，或通过非常规方式（如：恶意干预数据）影响口袋助手的正常服务,也不得对口袋助手软件进行反向编译，更不得在口袋助手软件中放置或嵌入木马程序或后门等危害第三方数据安全性的程序。否则，口袋助手将依法追究法律责任。\n\
· 口袋助手特别提醒您：口袋助手不编写任何脚本。您有权自行录制、编写任何脚本，您也可以通过购买或者其他合法渠道获得脚本。您通过合法渠道获得的脚本的知识产权归脚本作者所有。您不得通过任何渠道获得任何违反中华人民共和国法律法规或侵犯第三方合法权益的脚本。否则，因上述事宜所产生的一切法律责任均由您承担，口袋助手在此种情况下有权单方解除本协议，您应当同时负责赔偿口袋助手遭受的全部损失，包括但不限于任何的赔偿金、补偿金、违约金、罚款、诉讼费、调查取证费、公证费、律师费等。\n\
\n\
三、免责事由\n\
\n\
您知悉并同意，口袋助手不因下述任一情况而可能导致的任何损害赔偿承担责任，包括但不限于财产、收益、数据资料等方面的损失或其它无形损失：\n\
\n\
· 因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素导致口袋助手充值系统或服务不能正常运作。\n\
· 由于黑客攻击、电信部门技术调整或故障、系统维护等原因而造成的系统服务中断或者延迟。\n\
· 由于政府命令、法律法规的变更、司法机关及行政机关的命令、裁定等原因而导致的系统服务中断、终止或延迟。\n\
· 由于您将授权码或口袋助手帐户密码告知他人或未保管好自己的授权码密码或与他人共享口袋助手帐户或任何其他非本公司的过错，导致您的个人资料泄露。\n\
· 由于与本公司链接或合作的其它网站（如网上银行等）所造成的银行帐户信息、身份信息泄露及由此而导致的任何法律争议和后果。\n\
· 您（包括未成年人用户）向本公司提供错误、不完整、不实信息等，造成不能使用口袋助手帐户或遭受任何其他损失。\n\
· 如因系统维护或升级的需要而需暂停网络充值服务时，我们将尽可能事先进行通告。对于充值服务的中断或终止而给您造成的任何损失，我们无须对您或任何第三方承担任何责任。 \n\
\n\
四、违约责任 \n\
\n\
如您违反本协议项下的任何规则、声明、承诺及保证，我们保留根据实际损失向您追究责任的权利。\n\
\n\
五、法律适用与争议解决 \n\
\n\
本协议的订立、效力、解释、履行、修改和终止以及争议的解决适用中国的法律。因解释和履行本协议而发生的任何争议，本协议双方应首先通过友好协商的方式加以解决。如果在一方向其他方发出要求协商解决的书面通知后30天之内争议仍然得不到解决，则任何一方均有权向上海市奉贤区人民法院提起诉讼。\n\
\n\
六、隐私政策 \n\
\n\
口袋助手将严格保护您的隐私。您的个人信息将仅用于收集时即已确定并且经过您同意的目的，如有除此之外的任何其他用途，我们都会提前征得您的同意。在任何时候，您的信息均依照口袋助手的隐私政策处理，并可在口袋助手官网上浏览。 \n\
\n\
七、其他 \n\
\n\
· 口袋助手目前有iOS 版，除了 IPhone 3GS 以及 IPad 1 以外的所有越狱过的苹果设备都可以使用iOS 版。口袋助手安卓（Android）版本尚在开发中，但口袋助手安卓（Android）版亦将适用本协议（口袋助手另行做出特别规定的除外）。 \n\
· 本协议项下所有的通知均可通过重要页面公告等方式进行，该等通知于发送之日视为已送达您。 \n\
· 本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的，未赋予本协议各方其他权利。 \n\
· 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。\n\
· 本协议中的标题仅为方便而设，不具法律或契约效果。"